Autodesk.Revit.DB.SimpleWorksetConfiguration
Indicates the set of user-created worksets to open in memory
Since:
2014

Autodesk.Revit.DB.SimpleWorksetConfiguration.AskUserToSpecify
Explicitly ask the user the specify which user-created worksets to open.

Autodesk.Revit.DB.SimpleWorksetConfiguration.LastViewed
The set of user-created worksets last opened for this model.

Autodesk.Revit.DB.SimpleWorksetConfiguration.AllEditable
All user-created worksets checked out to the current user.

Autodesk.Revit.DB.SimpleWorksetConfiguration.AllWorksets
All user-created worksets.